# This file should ensure the existence of records required to run the application in every environment (production,
# development, test). The code here should be idempotent so that it can be executed at any point in every environment.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Example:
#
#   ["Action", "Comedy", "Drama", "Horror"].each do |genre_name|
#     MovieGenre.find_or_create_by!(name: genre_name)
#   end
questions = ["新しい技術を学ぶ際にどのようなアプローチを取りますか？具体的な例を挙げて説明してください。",
"チームで働く上で重要だと思うことは何ですか？過去の経験に基づいて教えてください。",
"あなたがこれまで直面した最も困難なバグは何でしたか？それをどのように解決しましたか？",
"プロジェクト管理において、どのようなツールや方法を使用していますか？その選択理由も教えてください。",
"成功したプロジェクトと失敗したプロジェクトの違いは何だと思いますか？具体的な体験をもとに説明してください。",
"プログラミング言語を選定する際、どのような基準を設けていますか？",
"リモートワークとオフィスワーク、どちらの環境が好みですか？その理由も含めて教えてください。",
"ストレスが高い状況でどのようにして冷静さを保ちますか？具体的な例を挙げてください。",
"キャリアで次に達成したいことは何ですか？その目標に向けてどのような計画を立てていますか？",
"コーディング以外で、どのようなスキルがあなたのエンジニアリングの仕事に役立っていますか？",
"最新の技術トレンドの中で、特に関心があるものは何ですか？その理由も教えてください。",
"プロジェクトで意見の相違があった際に、どのようにして解決策を見つけますか？",
"プログラミングにおけるあなたの強みと弱みは何ですか？",
"自己学習のためにどのようなリソースを利用していますか？",
"将来的に学びたいと考えている技術は何ですか？",
"プロジェクトのスコープや要件が急に変更された経験はありますか？そのときどのように対応しましたか？なければ、どのようにすべきか考えを聞かせてください",
"データベース設計において最も重視する点は何ですか？そして、その理由は何ですか？",
"コードレビューのプロセスにおいて、あなたが重要だと思うポイントは何ですか？",
"ユーザーエクスペリエンスの設計で最も注意を払うべきと思うポイントは何ですか？",
"クラウドサービス（AWS、Azure、Google Cloudなど）を使用したプロジェクトでの役割について詳しく教えてください。",
"過去に困難だったデバッグの経験について説明してください。その問題をどのように解決しましたか？",
"過去にチームやプロジェクトでリーダーシップをとった経験について教えてください。",
"プロジェクトで期限を守るためにどのような工夫をしていますか？",
"他部門とのコミュニケーションにおいて重要だと思うことは何ですか？具体的な経験を教えてください。",
"新しいプロジェクトを始める際に最初に行うことは何ですか？",
"チームや同僚、あるいは社会に向けて知識共有のためにどのような活動を行っていますか？",
"あなたが思う、効果的なドキュメンテーションとはどのようなものですか？",
"リファクタリングの経験について教えてください。どのような場合にリファクタリングを決定しますか？",
"最近取り組んでいる技術的な問題やプロジェクトについて説明してください。",
"ソフトウェア開発における倫理についてどのように考えていますか？",
"ビジネスまたは技術の観点で最も影響を受けた書籍やリソースは何ですか？",
"将来的にどのような分野でスキルを拡張したいですか？",
"チームで働くことと個人で働くこと、どちらを好みますか？その理由も教えてください。",
"将来的なキャリアの目標について教えてください。",
"成功とは何だと思いますか？個人的な見解を教えてください。",
"ストレスを管理するためにどのような方法を取り入れていますか？",
"仕事で直面する可能性のある困難に対して、どのように対処しますか？",
"仕事で達成感を感じる瞬間について教えてください。",
"チームプロジェクトにおいて、あなたが果たす役割について説明してください。",
"仕事において最も価値を置くことは何ですか？",
"キャリアで最も影響を受けた人物は誰ですか？その理由も教えてください。",
"自分の時間を効率的に管理するために使用しているツールやテクニックはありますか？",
"過去の仕事経験から学んだ最も重要な教訓は何ですか？",
"チーム内でコミュニケーションを取る際に重視することは何ですか？",
"新しいプロジェクトを始める際、最初に何をしますか？",
"キャリアの中で直面した最も大きな挑戦は何でしたか？それにどう対処しましたか？",
"仕事を選ぶ際に何を一番重視しますか？",
"長期的なプロジェクトに取り組む際のモチベーションをどのように保ちますか？",
"プロフェッショナルとして成長するために、現在どのような努力をしていますか？",
"仕事において、どのような種類の環境が最も生産性が高いと感じますか？",
"自己成長のために定期的に行っていることはありますか？",
"仕事で直面することが多い課題は何ですか、そしてそれにどのように対応していますか？"
]

questions.each do |question|
    Question.create!(content: question)
end